Revit 2027 API
FabricArea.IsValidMinorLapSplice Method
 Identifies if the specified value is valid for use as a minor lap splice.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidMinorLapSplice(
	double minorLapSplice
)
Public Function IsValidMinorLapSplice (
	minorLapSplice As Double
) As Boolean
public:
bool IsValidMinorLapSplice(
	double minorLapSplice
)
member IsValidMinorLapSplice :
        minorLapSplice : float -> bool
Parameters
minorLapSplice Double
 The minor lap splice value.
Return Value
Boolean
 True if the value is valid, false if the value is invalid.
Remarks
 The minor lap splice should be less than or equal to half of the overall width.
See Also
Reference
FabricArea Class
Autodesk.Revit.DB.Structure Namespace